# Groupby

<b>Groupby</b> Allows you to group together rows, based off of a column and perform a aggregate function on them

In [2]:
import numpy as np
import pandas as pd

In [4]:
data ={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Ashank', 'Saurav', 'Chandan', 'Nikhil', 'Tanmay', 'Ujjwal'], 
       'Sales':[200,120,340,124,243,350]} #Creating Dict of data

In [5]:
df = pd.DataFrame(data) #Creating dataframe out of dict

In [6]:
df

  Company   Person  Sales
0    GOOG   Ashank    200
1    GOOG   Saurav    120
2    MSFT  Chandan    340
3    MSFT   Nikhil    124
4      FB   Tanmay    243
5      FB   Ujjwal    350

In [7]:
df.groupby('Company') # This will return a groupby object

In [8]:
byComp = df.groupby('Company') # Stored the object and accessed aggregate func()

In [10]:
byComp.mean() # Aggregate Function mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [11]:
byComp.sum() # Aggregate Function sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [12]:
byComp.std() # Aggregate Function std() (Standard Deviation)

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [13]:
byComp.sum().loc['FB'] #Calc the sum of only FB

Sales    593
Name: FB, dtype: int64

In [14]:
df.groupby('Company').sum().loc['FB'] # Doing same in one line

Sales    593
Name: FB, dtype: int64

In [15]:
df.groupby('Company').count() # Aggregate Function count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [16]:
df.groupby('Company').max() # Aggregate Function max()

         Person  Sales
Company
FB       Ujjwal    350
GOOG     Saurav    200
MSFT     Nikhil    340

In [17]:
df.groupby('Company').min() # Aggregate Function min()

          Person  Sales
Company
FB        Tanmay    243
GOOG      Ashank    120
MSFT     Chandan    124

In [18]:
df.groupby('Company').describe() # Aggregate Function describe() (Auto)

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [19]:
df.groupby('Company').describe().transpose() # Aggregate Function transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [20]:
df.groupby('Company').describe().transpose()['FB'] # for FB

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64